package geoton.treveler.imfoFile;

/**
 * Created by ADMIN on 12/25/2016.
 */

public class MonumentAndDescription {
    public static String[] names = new String[]{
            "ბაგრატის ტაძარი",
            "ბებრის ციხე",
            "ბედიის მონასტერი",
            "ბეთანია",
            "ბირთვისის ციხე",
            "ბოდბე",
            "ბოლნისის სიონი",
            "ბორას საყდარი"
    };

    public static String[] descriptions = new String[]{
            "ბაგრატის ტაძარი ბაგრატის ტაძარს თავისი ხუროთმოძღვრული და მხატვრული ღირსებით განსაკუთრებული ადგილი უჭირავს ქართული არქიტექტურის ისტორიაში, როგორც განვითარებული შუა საუკუნეების დროინდელი სტილის საბოლოოდ დამამკვიდრებელ ნაწარმოებს. ისტორიულად კი იგი გაერთიანებული საქართველოს სიმბოლოა.\n" +
                    "\n" +
                    "ტაძრის აღმოსავლეთი მკალავის ჩრდილოეთის სარკმლიდან ქვევით მოთავსებულ წარწერაში, სადაც იატაკის დაგების თარიღია მითითებული, საქართველოში არაბული ციფრების ხმარების უძველესი ნიმუშია წარმოდგენილი: ”ქ. ოდეს განმტკიცნა იატაკი, ქორონიკონი იყო 223”.",

            "ბებრის ციხე ციხე აგებულია ადრინდელ ფეოდალურ ხანაში. ბებრისციხე ქართულ საისტორიო წყაროებში პირველად მოხსენიებულია ლაშა გიორგის დროინდელ მემატიანესთან: “დემეტრე მეფე ბებრის ციხეს მიიცვალა და გელათს წაიყვანეს მისგანვე კურთხეულსა ახალსა მონასტერსა”. ეს მოხდა 1156 წელს. \n" +
                    "ვახუშტი ბაგრატიონი მას ბელტის ციხედ მოიხსენიებს.\n" +
                    "\n" +
                    "2010 წლის გაზაფხულის წვიმებმა გამოიწვია მეწყერის ჩამოწოლა, რის შედეგადაც ჩამოწოლილმა მეწყერმა მთლიანად ჩამოშალა ციხის ჩრდილო-აღმოსავლეთი კედელი. დაბზარულია ციხის დანარჩენი კედლებიც. ამჟამად, მიმდინარეობს აღდგენითი სამუშაოები.",

            "ბედიის მონასტერი ბედია უძველესი დასახლებული პუნქტია XI ს-ის ქართველი ისტორიკოსის ლეონტი მროველის საეკლესიო-ბიბლიურ მოძღვრებაზე დამყარებული თეორიის მიხედვით. ბიბლიური ნოეს მესამე შვილის _ იაფეთის შვილიშვილის შვილი თარგამოსი, მაშინ, როდესაც ბაბილონში გოდოლის აშენების გამო, ენათა აღრევა და ხალხთა დიდი გაბნევა მოხდა, თავის მრავალრიცხოვანი ახლობლებით პონტოს (შავ) და გურგანის (კასპიის) ზღვებს შორის დამკვიდრდა და სათავე დაუდო კავკასიელ ხალხთა წარმომავლობას. მან თავის მერვე ვაჟიშვილს _ ეგროსს მისცა ზღვის სანაპირო ქვეყანა პონტოს ზღვასა და ლიხის მთას შორის, ვიდრე მდინარემდე მცირისა ხაზარეთისა, `სადაცა წარსწუთების წუერი კავკასიისა~. იქ ეგროსს აუგია ქალაქი, რომლისთვისაც თავისი სახელის მიხედვით ეგრისი დაურქმევია. ეს ის ადგილია, რომელსაც ახლა ბედია ჰქვიანო, _ იუწყება ლეონტი მროველი. ვახუშტი ბატონიშვილის ცნობით, VIII ს-ის უკანასკნელ მეოთხედში დასავლეთ საქართველოს ტერიტორიაზე `აფხაზთა~ სამეფოს სახელით აღდგენილი დასავლურ-ქართული სახელმწიფო `აფხაზთა~ მეფე ლეონმა რვა საერისთავოდ დაყო, რომელთაგან\n" +
                    "ერთ-ერთი ეგრისწყალსა (მდ. ღალიძგა) და ცხენისწყალს შუა განათავსა ცენტრით ბედიაში.\n" +
                    "ბედიის მონასტერში დასაფლავებულია გაერთიანებული საქართველოს პირველი მეფე ბაგრატ III კურაპალატი.",

            "ბეთანია ბეთანიის მონასტერი უკვე არსებობდა XI საუკუნეში, რომელიც ორბელიანთა საგვარეულო საძვალეს წარმოადგენდა. ბეთანიის ღვთისმშობლის შობის ტაძარი, სავარაუდოდ, XII საუკუნის დასასრულს – XIII საუკუნის დასაწყისში აიგო იმ ადგილას, სადაც X-XI საუკუნეების პატარა აგურის ეკლესია იდგა. 1196 წელს, იოანე ორბელიანის მეუღლემ რუსუდანმა, მთავარი ტაძრის გვერდით მცირე ზომის წმინდა გიორგის ეკლესია ააგო. XIII საუკუნედან, მონასტერი უკვე სამეფო კუთვნილებას წარმოადგენდა. სამწუხაროდ ისტორიული ცნობები ამ მონასტრის შესახებ ძალზედ მწირია, თუმცა შემორჩენილი ფრესკები, ჩუქურთმები და წარწერები იმას გვაუწყებენ, რომ ბეთანიის მონასტერი თავის დროზე არაერთხელ დანგრეულა და აღდგენილა. 1851 წელს გრიგოლ ორბელიანმა, ნადირობისას სრულიად შემთხვევით აღმოაჩინა ეს მიტოვებული ადგილი, ხოლო მხატვარმა გ. გაგარინმა კი ჩამონგრეული ქვების გასუფთავების შედეგად, თამარ მეფის ფრესკაც გამოაჩინა, რაც გახდა საზოგადოების მხვრივ ამ ძეგლისადმი ინტერესის გამოჩენა. რუსმა მხატვარმა თავისი ხარჯებით, აღადგინა როგორც თამარ მეფის ფრესკა, აგრეთვე დანარჩენი სხვა ფრესკებიც, გააკეთა მათი ჩანახატები და გამოუშვა წიგნი.\n" +
                    "იმავე საუკუნის მიწურულს გამოჩნდნენ ბერები, რომლებიც შეუდგნენ დანგრეული მონასტრის აღდგენას. თავდაპირველად მოვიდა მღვდელი-მონაზონი სპირიდონი, რომელიც მარტო ცხოვრობდა მონასტერში, შემდეგ მას შეურთდა თოთხმეტი წლის გლეხი ბიჭი ვასილ მაისურაძე, (შემდგომ უკვე არქიმანდრიტი იოანე). მონასტერი თანდათან გამოცოცხლდა, ხოლო რამდენადაც უცნაური და გასაკვირი არ უნდა იყოს, საბჭოთა რეჟიმის დროსაც კი არ შეუწყვეტიათ ბერებს აქ მოღვაწეობა. ამ პერიოდში მონასტერში მოღვაწეობდნენ მამა იოანე, მამა გიორგი და მამა ბასილი. ბეთანიის მონასტერი ერთადერთი ადგილი იყო სადაც აღესრულებოდა წირვები, ლოცვები, ჯვრისწერები, ნათლობები, ოფიციალურად კი ბეთანია კულტურულ ძეგლად იყო აღნიშნული, სადაც ბერები ვითომ და მისი დარაჯები იყვნენ, რომლებსაც შესაბამისად ხელფასსაც კი უხდიდნენ. ამ ბერების გარდაცვალების შემდეგ, (მამა გიორგი და იოანე წმინდანებად აკურთხეს) მონასტერი ცოტა ხნით დაცარიელდა, თუმცა 1978 წელს, უწმინდესმა და უნატარესმა ილია მეორემ, (ისევ და ისევ კომუნისტობის ჟამს) ხელისუფლებისგან გამოითხოვა ნებართვა რათა მონასტერი აღდგენილიყო და მართლაც სასწაული, ხელისუფლებისგან მიიღო თანხმობა. იმ დღიდან მოყოლებული დღემდე ამ ადგილს არ შეუწყვეტია სულიერი ცხოვრება.",

            "ბირთვისის ციხე ბირთვისის ციხის აგების თარიღი უცნობია, თუმცა ისტორიულ წყაროებში პირველად იგი XI საუკუნეშია მოხსენებული. როგორც „მატიანე ქართლისაის“ ავტორი გვატყობინებს,  თბილისისთვის ერთ-ერთი ბრძოლის დროს „ლიპარიტ ლიპარიტის ძემან და ივანე აბაზას-ძემან, ქართლის ერისთავმან, მუხათგუერდსა გამოიტყუეს ტფილისელი ამირა ჯაფარ, და შეიპყრეს,  და დიდი ხანი დაყვეს პატიმრობასა შინა, და წარუღეს ბირთვისი“. როგორც ირკვევა, ბაგრატ III-ის მეფობის დროს, ქვემო ქართლის ნაწილი ბირთვისიანად ამირას ხელში იყო. მოგვიანებით კლდეკარის ერისთავმა ლიპარიტ ლიპარიტის ძემ, სხვა ციხეებთან ერთად, ბირთვისის ციხეც დაკარგა.  ",

            "ბოდბე წერილობით წყაროებში სხვადახსვაგვარად მოხსენიებული გეოგრაფიული პუნქტი – ბოდო, ბუდი, ბოდისი, ბოდისი, ბოდინო, სადაც აღესრულა და დაიკრძალა წმინდა ნინო – მკლევართა უმრავლესობის აზრით არის ის ადგილი, სადაც ამჟამად მდებარეობს ბოდბის მონასტერი. ცნობები წმ. ნინოს დაკრძალვის ადგილზე პირველი ეკლესიის მშენობლობის შესახებ დაცულია ქართულ წერილობით წყაროებში, მართალია, აქ ნაგებობის არქიტექტურული სახის შესახებ არაფერია ნათქვამი, მაგრამ წარმოდგენილია მეტად ძვირფასი მასალა შენობის არსის და მისი მნიშვნელობის გაგებისათვის. `მოქცევაი ქართლისაი~ მიხედვით წმინდანის საფლავი მიწის ქვეშაა მოქცეული, ეკლესია ააგეს უშუალოდ საფლავზე. საინტერესოა ნაწყვეტი მეფე მირიანის ანდერძიდან, რომელშიც მხოლოდ ბოდბე და წმინდა ნინოს დაკრძალვის ადგილი არ იგულისხმება, არამედ გარკვეული მხარე, რომლის ერთ-ერთ ცენტრსაც იგი წარმოადგენდა. წმ. ნინოს დაკრძალვის ერთ-ერთი გვიანდელი ვერსია, რომელიც არსენ ბერს ეკუთვნის (XII საუკუნის II ნახევარი) მოგვითხრობს, რომ მეფე მირიანმა წმინდანის დაკრძლვის ადგილზე: ` ... აღაშენა ზედა ლუსკუმასსა მისსა მეფემან ტაძარი, ფრიად შუენიერი, და განაჩინა საეპისკოპოსოდ. და მიერითგან აქამომდე სასწაულნი და ნიშნი ურიცხუნი აღესრულებიან ნაწილთაგან მისთა წმიდათა სადიდებლად მამისა და ძისა და წმიდასა სულისა აწ და მარადის და უკუნითი უკუნისამდე~.\n" +
                    "მაშასადამე XII საუკუნეში ბოდბეში ნამდვილად იყო საეპისკოპოსო კათედრა, თუმცა ეს არ ნიშნავს, რომ უფრო ადრინდელ ხანაში იგი არ არსებობდა. საისტორიო წყაროებზე დაყრდნობით ასკვნიან, რომ ბოდბის საეპისკოპოსო ვახტანგ გორგასალის ეპოქაში უკვე არსებობდა. აქაურ ეპისკოპოსს მონაწილეობა მიუღია 506 წელს დვინში გამართულ ქართულ-სომხურ-ალბანური ეკლესიების გაერთიანებულ კრებაში. ბოდბის საეპისკოპოსოს დიდი მნიშვნელობა ჩანს XIII საუკუნის ერთ-ერთ დოკუმენტიდან (`განგება დარბაზობისა~), სადაც 35 ეპისკოპოსთა რიგში ქისიყელი (იგივე ბოდბელი) მეშვიდე ადგილზეა მოხსენიებული, ალავერდელსა და კუმურდოელს შორის, რაც დიდ პატივს ნიშნავს. ",

            "ბოლნისის სიონი ბოლნისის სიონი ერთ-ერთი უდიდესი ბაზილიკათაგანია საქართველოში. განეკუთვნება V საუკუნეს. VIII საუკუნეში ტაძარზე აღმოსავლეთიდან მცირე სამლოცველო მიაშენეს. დროთა განმავლობაში დაინგრა ჩრდილოეთის თაღებიანი სტოა-გალერეა. 1634 წელს სპარსელების შემოსევის შედეგად ტაძარი ძლიერ დაზიანდა, დაზიანება ძირითადად შეეხო კამარებსა და დასავლეთის კედელს, რომელიც XVII საუკუნეში როსტომ მეფისა და მარიამ დედოფლის ბრძანებით აღადგინეს. ამ დროს იქნა გაჭრილი დასავლეთის კარიც. ამავე საუკუნის ბოლოს გიორგი XI-ის ბრძანებით ბოლნელმა ეპისკოპოსმა ნიკოლოზმა ეკლესია კვლავ შეაკეთა, მოახატვინა და ტაძრის სამხრეთ-დასავლეთით სამრეკლოც აღმართა. ამის შესახებ გვამცნობს სამრეკლოზე განთავსებული წარწერა. ეს შეკეთებები უმთავრესად აგურით იყო შესრულებული. \n" +
                    "ტაძრის აშენების ზუსტი თარიღის დადგენა მოხერხდა მის ფასადზე არსებული სამშენებლო წარწერის მეშვეობით. წარწერა გვამცნობს: ”შეწევნითა წმიდისა სამებისაითა ოც წლისა პეროზ მეფისა ზე ხიქმნა დაწყებაი ამის ეკლესიისაი და ათოთხმეტ წლისა სემდგომად განეშორა”. დღეს წარწერიანი ფილა საქართველოს ხელოვნების მუზეუმშია დაცული (ადგილზე კი ასლია ჩასმული). \n" +
                    "ბოლო სარესტავრაციო-საკონსერვაციო სამუშაოები ტაძარს 1970-1971 წლებში ჩაუტარდა.",

            "ბორას საყდარი სტილისტური ნიშნებით ბორას (ბოძის) საყდარი თარიღდება X საუკუნით. ამჟამად მიმდინარეობს აღდგენა, სარეტავრაციო სამუშაოები, რომელსაც ადგილობრივი ახალგაზრდობა აწარმოებს თავისი საკუთარი ძალითა და სახსრებით."

    };


    public static String[] images = new String[]{
            "http://www.dzeglebi.ge/dzeglebi/b/bagrati/bagrati_lika_02.jpg",
            "http://www.dzeglebi.ge/dzeglebi/b/bebris_cixe/bebriscixe_02.jpg",
            "http://www.dzeglebi.ge/dzeglebi/b/bedia/bediid_monasteri_qartuli.jpg",
            "http://www.dzeglebi.ge/dzeglebi/b/betania/betania2.jpg",
            "http://www.dzeglebi.ge/dzeglebi/b/birtvisi/birtvisi.jpg",
            "http://www.dzeglebi.ge/dzeglebi/b/bodbe/bodbe_03.jpg",
            "http://www.dzeglebi.ge/dzeglebi/b/bolnisis%20sioni/bolnisi_siopni_03.jpg",
            "http://www.dzeglebi.ge/dzeglebi/b/boras%20saydari/bora.jpg"

    };

    public static String[] location = new String[]{
            "-33.867, 151.206",
            "-33.867, 151.206",
            "-33.867, 151.206",
            "-33.867, 151.206",
            "-33.867, 151.206",
            "-33.867, 151.206",
            "-33.867, 151.206",
            "-33.867, 151.206"
    };
}

